### SQL AND SQLITE

SQL(Structured query language) is a standard language for managing and manipulating relational databases. SQLite is a self-contained, serverless, and zero-configuration database engine that is widely used for embedded database systems.

In [19]:
import sqlite3

In [20]:
## connect to an sqlite database 
connection=sqlite3.connect("example.db")
print(connection)

<sqlite3.Connection object at 0x0000020F866253F0>

In [21]:
cursor=connection.cursor()

In [22]:
## create a table
cursor.execute("""CREATE TABLE IF NOT EXISTS users
                  (id INTEGER PRIMARY KEY,
                  name TEXT, 
                  age INTEGER,
                  department text)
                  """)
connection.commit()

In [23]:
cursor.execute("""select * from users;
                  """)

In [24]:
cursor.execute("""
INSERT INTO users (name, age, department) VALUES
('Rahul', 22, 'CSE'),
('Pavan', 23, 'ECE'),
('Teja', 21, 'MECH'),
('Siri', 22, 'IT'),
('Vinay', 24, 'EEE'),
('Hemanth', 25, 'CIVIL'),
('Kiran', 23, 'AIML'),
('Priya', 22, 'CSE'),
('Neha', 21, 'IT'),
('Arjun', 24, 'CSE')
""")

connection.commit()

In [25]:
cursor.execute('select * from users;')
print(cursor.fetchall())

[(1, 'Rahul', 22, 'CSE'), (2, 'Pavan', 23, 'ECE'), (3, 'Teja', 21, 'MECH'), (4, 'Siri', 22, 'IT'), (5, 'Vinay', 24, 'EEE'), (6, 'Hemanth', 25, 'CIVIL'), (7, 'Kiran', 23, 'AIML'), (8, 'Priya', 22, 'CSE'), (9, 'Neha', 21, 'IT'), (10, 'Arjun', 24, 'CSE')]

In [32]:
import pandas as pd

df = pd.read_sql("SELECT * FROM users", connection)
df

   id     name  age department
0   1    Rahul   22        CSE
1   2    Pavan   23        ECE
2   3     Teja   21       MECH
3   4     Siri   22         IT
4   5    Vinay   24        EEE
5   6  Hemanth   25      CIVIL
6   7    Kiran   23       AIML
7   8    Priya   22        CSE
8   9     Neha   21         IT
9  10    Arjun   24        CSE

In [34]:
## querying the data from sqlite3 
cursor.execute('''
               select * from users;''')
rows=cursor.fetchall()
for row in rows :
    print(row)

(1, 'Rahul', 22, 'CSE')
(2, 'Pavan', 23, 'ECE')
(3, 'Teja', 21, 'MECH')
(4, 'Siri', 22, 'IT')
(5, 'Vinay', 24, 'EEE')
(6, 'Hemanth', 25, 'CIVIL')
(7, 'Kiran', 23, 'AIML')
(8, 'Priya', 22, 'CSE')
(9, 'Neha', 21, 'IT')
(10, 'Arjun', 24, 'CSE')

In [35]:
cursor.execute("""
UPDATE users
SET age = 23, department = 'IT'
WHERE id = 1
""")
connection.commit()

In [36]:
## querying the data from sqlite3 
cursor.execute('''
               select * from users;''')
rows=cursor.fetchall()
for row in rows :
    print(row)

(1, 'Rahul', 23, 'IT')
(2, 'Pavan', 23, 'ECE')
(3, 'Teja', 21, 'MECH')
(4, 'Siri', 22, 'IT')
(5, 'Vinay', 24, 'EEE')
(6, 'Hemanth', 25, 'CIVIL')
(7, 'Kiran', 23, 'AIML')
(8, 'Priya', 22, 'CSE')
(9, 'Neha', 21, 'IT')
(10, 'Arjun', 24, 'CSE')

In [39]:
cursor.execute("DELETE FROM users WHERE age >22")
connection.commit()

In [40]:
## querying the data from sqlite3 
cursor.execute('''
               select * from users;''')
rows=cursor.fetchall()
for row in rows :
    print(row)

(3, 'Teja', 21, 'MECH')
(4, 'Siri', 22, 'IT')
(8, 'Priya', 22, 'CSE')
(9, 'Neha', 21, 'IT')

In [41]:
## connection closing
connection.close()